package com.callor.blackjack;

public class BlackJack {
	
	/*
	 * Winner winner chicken dinner - 승자에게
	 * 52개의 카드
	 * 2 ~ 10 숫자 J K Q A
	 * 빨강 ◆  ♥  검정 ♣  ♠
	 * 
	 * 게임의 목적은 딜러상대로 승리하는것.
	 * 블랙잭의 승리 조건은 딜러보다 높은 가치의 카드소유하거나 정확히 21의 가치를 가진
	 * 카드를 얻으면 승리 다만 21을 초과한 카드를 소유하게되면 버스트로 패배하게됨.
	 * ACE는 1 혹은 11  J , K , Q 은 각각 10의 가치
	 * 
	 * 플레이어는 모두 숫자가 보이는 카드2장 / 딜러는 보이는 카드1장과 안보이는카드1장을 가지고 게임을 시작
	 * 
	 * 플레이어는 6가지 선택을 할수있다
	 * 카드 2장을받았을때 ACE 한장과 10의 가치를 가진 카드를 받으면 총 21의가치가 되면 '블랙잭'이다
	 * 이럴경우 딜러가 블랙잭 패를 가지고있지않으면 플레이어승리
	 * 처음 받은 2장의 카드가 승부하기에 충분하다고 판단되면 '스탠드' 를 선언할수있다
	 * 딜러는 플레이어가 21을 초과하는 숫자를 받게되면 '버스트'가 되며 '스탠드' 를 선택할때까지
	 * 한번에 한장씩 카드를 제공한다 받을수있는 카드에 제한은 없으나 버스트가 되면 종료된다
	 * 
	 * 플레이어의 패가 버스트 되었거나 스탠드를 선언하면 딜러는 뒷면으로 뒤집어두었더 카드를 앞면으로 뒤집어
	 * 2장의 카드의 가치의 합을 확인한다 딜러 카드의 합이 17이상이면 자동으로 스탠드가 되고
	 * 딜러 카드의 합이 16 이하이면 추가로 히트(카드를 받는다)
	 * 딜러는 기본적으로 선택의 여지가없이 카드의 합계에 따라 플레이가 정해진다
	 * 단 ace 와 6의 조합으로 17이 되는경우에는 ace가 1 또는 11 이기때문에 딜러는 추가로 히트로 진행할수있다
	 */

}
